//=============================================================================
//
// 大砲処理 [cannon.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _CANNON_H_
#define _CANNON_H_

#include "main.h"
#include "enemy.h"

//=============================================================================
// マクロ定義

#define CAN_MAX		(1)


//=============================================================================
// 構造体宣言

typedef struct
{
	ENE			ene;		// エネミーの基本構造体
	int			ShotCD;		// 弾発射のクールダウン
}CAN;



//=============================================================================
// プロトタイプ宣言
HRESULT InitCannon(void);
void UninitCannon(void);
void UpdateCannon(void);
void DrawCannon(void);
CAN *GetCannon(int no);
#endif
