//=============================================================================
//
// 車処理 [car.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _CAR_H_
#define _CAR_H_

#include "main.h"
#include "enemy.h"

//=============================================================================
// マクロ定義

#define CAR_MAX		(1)


//=============================================================================
// 構造体宣言

typedef struct
{
	ENE			ene;		// エネミーの基本構造体
	float		Turn;		// エネミーの回転量
}CAR;



//=============================================================================
// プロトタイプ宣言
HRESULT InitCar(void);
void UninitCar(void);
void UpdateCar(void);
void DrawCar(void);
CAR *GetCar(int no);
#endif
