//=============================================================================
//
// 環境の処理 [environment hub.cpp]
// Author : 川井一生
/*
envirment.cpp ではマップと木や石などマップ上にあるオブジェクトなどを管理する

hub for map and rocks and trees /etc on the map
*/
//=============================================================================

#include "environment hub.h"

//===========================
// オブジェクト	object
#include "tree.h"
#include "rock.h"
#include "crate.h"
#include "house.h"
#include "gate.h"
#include "fence.h"
#include "stage.h"

//===========================
// アイテム		item
#include "gem.h"



//=============================================================================
// マクロ定義


//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数
BILL			billWk;
MESH			meshWk;

//=============================================================================
// 初期化処理
HRESULT InitEnvironment(void)
{

	//==========================================================
	//　オブジェクト	object

	// 家の初期化処理
	InitHouse();

	// 門の初期化処理
	InitGate();

	// 箱の初期化処理
	InitCrate();

	// 木の初期化処理
	InitTree();

	// 石の初期化処理
	InitRock();

	// 策の初期化処理
	InitFence();

	// 台の最新処理
	InitStage();

	//==========================================================
	// アイテム		item

	// ジェムの初期化処理
	InitGem();

	return S_OK;
}

//=============================================================================
// 終了処理
void UninitEnvironment(void)
{
	//==========================================================
	//　オブジェクト	object

	// 家の終了処理
	UninitHouse();

	// 門の終了処理
	UninitGate();

	// 箱の終了処理
	UninitCrate();

	// 木の終了処理
	UninitTree();

	// 石の終了処理
	UninitRock();

	// 策の終了処理
	UninitFence();

	// 台の終了処理
	UninitStage();

	//==========================================================
	// アイテム		item

	// ジェムの終了処理
	UninitGem();

}

//=============================================================================
// 最新処理
void UpdateEnvironment(void)
{
	//==========================================================
	//　オブジェクト	object

	// 家の最新処理
	UpdateHouse();

	// 門の最新処理
	UpdateGate();

	// 箱の最新処理
	UpdateCrate();

	// 木の最新処理
	UpdateTree();

	// 石の最新処理
	UpdateRock();

	// 策の最新処理
	UpdateFence();

	// 台の最新処理
	UpdateStage();

	//==========================================================
	// アイテム		item

	// ジェムの最新処理
	UpdateGem();

}

//=============================================================================
// 描画処理
void DrawEnvironment(void)
{
	//==========================================================
	//　オブジェクト	object

	// 家の描画処理
	DrawHouse();

	// 門の描画処理
	DrawGate();

	// 箱の描画処理
	DrawCrate();

	// 木の描画処理
	DrawTree();

	// 石の描画処理
	DrawRock();

	// 策の描画処理
	DrawFence();

	// 台の描画処理
	DrawStage();

	//==========================================================
	// アイテム		item

	// ジェムの描画処理
	DrawGem();

}

//=============================================================================
// ビルボードのゲット関数
BILL *GetBill(void)
{
	return (&billWk);
}
//=============================================================================
// メッシュのゲット関数
MESH *GetMesh(void)
{
	return(&meshWk);
}
