//=============================================================================
//
// 車処理 [house.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _HOUSE_H_
#define _HOUSE_H_

#include "main.h"
#include "environment hub.h"

//=============================================================================
// マクロ定義

#define HOUSE_MAX		(1)


//=============================================================================
// 構造体宣言

typedef struct
{
	MESH		mesh;		//メッシュオブジェクトの基本構造体
}HOUSE;



//=============================================================================
// プロトタイプ宣言
HRESULT InitHouse(void);
void UninitHouse(void);
void UpdateHouse(void);
void DrawHouse(void);
HOUSE *GetHouse(int no);
#endif
