//=============================================================================
//
// 径路の処理 [path.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _PATH_H_
#define _PATH_H_

#include "main.h"

//=============================================================================
// マクロ定義

#define POINT_MAX	(10)
#define PATH_MAX	(1)


//=============================================================================
// 構造体宣言

typedef struct
{
	D3DXVECTOR3		Start;
	D3DXVECTOR3		Point[POINT_MAX];
}PATH;



//=============================================================================
// プロトタイプ宣言
void InitPath(void);
void UpdatePath(D3DXVECTOR3 *tOut, D3DXVECTOR3 pos0, int Idx);

PATH *GetPath(int no);
#endif
