//=============================================================================
//
// 経路の処理 [path.cpp]
// Author : 川井一生
//
//=============================================================================
#include "path.h"

#include "player.h"

/*
エネミーとNPC動く経路を管理する処理

path.cpp is for enemy pathing
*/

//=============================================================================
// マクロ定義



//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数
PATH		pathWk[PATH_MAX];

//=============================================================================
// 初期化処理
void InitPath(void)
{
	PATH *path = &pathWk[0];
	int i;
	for (i = 0; i < PATH_MAX; i++, path++)
	{
		for (int j = 0; j < PATH_MAX; j++)
		{

		}
	}
}
void UpdatePath(void)
{
	PATH *path = &pathWk[0];

}

PATH *GetPath(int no)
{
	return(&pathWk[no]);
}
