//=============================================================================
//
// サイト処理 [sight.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _SIHGT_H_
#define _SIHGT_H_

#include "main.h"
#include "enemy.h"

//=============================================================================
// マクロ定義

#define SIGHT_MAX		(1)


//=============================================================================
// 構造体宣言

typedef struct
{
	ENE			ene;		// エネミーの基本構造体
	int			PathIdx;		// 歩く場所のID
}SIGHT;



//=============================================================================
// プロトタイプ宣言
HRESULT InitSight(void);
void UninitSight(void);
void UpdateSight(void);
void DrawSight(void);
SIGHT *GetSight(int no);
#endif
