//=============================================================================
//
// タイトル画面処理 [title.cpp]
// Author : 川井一生
//
/*
タイトルでロゴ、マップとオブジェクトを描画
スタートでゲーム内で使わないものをリリース

title uses logo map and objects on map
releace thing not used in game when start is selected
*/
//=============================================================================
#include "title.h"
#include "title_text.h"
#include "input.h"
#include "fade.h"

//===============================================
// マップ
#include "map.h"
#include "meshwater.h"
#include "skybox.h"

//===============================================
// オブジェクト
#include "environment hub.h"

//===============================================
// その他
#include "light.h"
#include "shadow.h"
#include "camera.h"
#include "effect.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


// メッシュの水の初期設定
#define WATER_POS		(D3DXVECTOR3(0.0f, -100.0f, 0.0f))
#define WATER_ROT		(D3DXVECTOR3(0.0f, 0.0f, 0.0f))
#define WATER_B_CNT_X	(250)
#define WATER_B_CNT_Z	(250)
#define WATER_B_SCL_X	(75.0f)
#define WATER_B_SCL_Z	(75.0f)



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************



//=============================================================================
// 初期化処理
//=============================================================================
void InitTitle(int oldMode)
{
	switch (oldMode)
	{
	case MODE_NULL:
		//=======================
		// マップの初期化
		InitMap();
		InitMeshWater(WATER_POS, WATER_ROT, WATER_B_CNT_X, WATER_B_CNT_Z, WATER_B_SCL_X, WATER_B_SCL_Z);
		InitSkyb();
		InitLight();
		InitShadow();

		//=======================
		// オブジェクトの初期化
		InitEnvironment();

		//=======================
		// タイトル画面のロゴの初期化処理
		InitTitleText();

		//=======================
		// その他の初期化
		InitCamera(MODE_TITLE);
		InitLight();
		InitShadow();
		InitEffect();
		break;
	case MODE_GAME:
		//=======================
		// タイトル画面の初期化
		InitTitleText();

		break;
	case MODE_RESULT:
		break;
	}

}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(int mode)
{
	switch (mode)
	{
	case MODE_GAME:
		// ゲームの中で使わないものをリリース
		UninitTitleText();
		break;
	case MODE_RESULT:
		break;
	}
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{

	//=======================
	// マップの最新処理
	UpdateMap();
	UpdateMeshWater();
	UpdateSkyb();

	//=======================
	// オブジェクトの最新処理
	UpdateEnvironment();
	
	//=======================
	// タイトル画面のテキストを初期化
	UpdateTitleText();

	//=======================
	// カメラの最新処理
	UpdateCamera();

	UpdateEffect();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	//=======================
	// マップの描画処理
	DrawMap();
	DrawMeshWater();
	DrawSkyb();
	//=======================
	// オブジェクトの描画処理
	DrawEnvironment();
	//=======================
	// タイトル画面のタイトルの描画処理
	DrawTitleText();

	DrawEffect();
}

