//=============================================================================
//
// タイトル画面のテキストの処理 [title_text.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _FENCE_TEXT_H_
#define _FENCE_TEXT_H_

#include "main.h"

//=============================================================================
// マクロ定義



//=============================================================================
// プロトタイプ宣言
HRESULT InitTitleText(void);
void UninitTitleText(void);
void UpdateTitleText(void);
void DrawTitleText(void);
#endif
