//=============================================================================
//
// ユーザーインターフェースの処理 [ui.cpp]
// Author : 川井一生
/*
ui.cpp でユーザーインターフェースの一括管理

hub for ui and ui related accessories
*/
//=============================================================================
#include "waypoint.h"
#include "help_text.h"
#include "UI.h"
#include "score.h"
//=============================================================================
// マクロ定義


//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数

//=============================================================================
// UIの最新処理
HRESULT InitUiHub(void)
{
	// 方向矢印の初期化処理
	//InitWaypoint();

	// UIのテキストの初期化処理
	InitHelpText();

	// UIのテキストの初期化処理
	InitUi();

	// スコアの初期化処理
	InitScore();

	return S_OK;
}
//=============================================================================
// UIの終了処理
void UninitUiHub(void)
{
	// 方向矢印の終了処理
	//UninitWyapoint();

	// UIのテキストの終了処理
	UninitHelpText();

	// UIのテキストの終了処理
	UninitUi();

	// スコアの終了処理
	UninitScore();

}
//=============================================================================
// UIの最新処理
void UpdateUiHub(void)
{
	// 方向矢印の最新処理
	//UpdateWaypoint();

	// UIのテキストの最新処理
	UpdateHelpText();

	// UIのテキストの最新処理
	UpdateUi();

	// スコアの最新処理
	UpdateScore();

}
//=============================================================================
// UIの描画処理
void DrawUiHub(void)
{
	// 方向矢印の描画処理
	//DrawWaypoint();

	// UIのテキストの描画処理
	DrawHelpText();

	// UIのテキストの描画処理
	DrawUi();

	// スコアの描画処理
	DrawScore();

}
